GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
/****************************************************************************
 * arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>
#include <nuttx/spinlock.h>
#include <nuttx/power/pm.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <arch/board/board.h>
#include "arm_internal.h"
#include "chip.h"
#include "gd32h73x_75x_usart.h"
#include "gd32h73x_75x.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Power management definitions */

#if defined(CONFIG_PM) && !defined(CONFIG_GD32H73X_75X_PM_SERIAL_ACTIVITY)
#  define CONFIG_GD32H73X_75X_PM_SERIAL_ACTIVITY 10
#endif

#if defined(CONFIG_PM)
#  define PM_IDLE_DOMAIN             0 /* Revisit */
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#ifdef USE_SERIALDRIVER

#ifdef HAVE_SERIALDRIVER

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)

/* USART DMA priority */
#if defined(CONFIG_GD32H73X_75X_USART_PRIQ)
#  define USART_DMA_PRIO  CONFIG_GD32H73X_75X_USART_PRIQ
#else
#  define USART_DMA_PRIO  DMA_PRIORITY_MEDIUM
#endif

#  define USART_RXDMA_INTEN (DMA_CHXCTL_HTFIE | DMA_CHXCTL_FTFIE)
#  define USART_TXDMA_INTEN DMA_CHXCTL_FTFIE
#endif

#ifdef SERIAL_HAVE_RXDMA
/* The DMA buffer size when using RX DMA to emulate a FIFO.
 * When the USART receives data, it is copied by DMA into this circular
 * buffer and then copied into the RX buffer for the serial driver by the
 * DMA callback function.  The size of this buffer must be a power of 2.
 */
#  if !defined(CONFIG_GD32H73X_75X_SERIAL_RXDMA_BUFFER_SIZE)
#    define CONFIG_GD32H73X_75X_SERIAL_RXDMA_BUFFER_SIZE 32
#  endif
#  if defined(CONFIG_ARMV7M_DCACHE)
#    define RXDMA_BUFFER_MASK   (ARMV7M_DCACHE_LINESIZE - 1)
#    define RXDMA_BUFFER_SIZE   ((CONFIG_GD32H73X_75X_SERIAL_RXDMA_BUFFER_SIZE \
                                  + RXDMA_BUFFER_MASK) & ~RXDMA_BUFFER_MASK)
#    define RXDMA_BUFFER_ALIGN  aligned_data(ARMV7M_DCACHE_LINESIZE)
#  else
#    define RXDMA_BUFFER_SIZE   (CONFIG_GD32H73X_75X_SERIAL_RXDMA_BUFFER_SIZE)
#    define RXDMA_BUFFER_ALIGN
#  endif

#endif

/* If built with CONFIG_ARMV7M_DCACHE, TX DMA buffers need to be aligned
 * and multiples of ARMV7M_DCACHE_LINESIZE.
 */

#ifdef SERIAL_HAVE_TXDMA
#  if defined(CONFIG_ARMV7M_DCACHE)
#    define TXDMA_BUF_MASK      (ARMV7M_DCACHE_LINESIZE - 1)
#    define TXDMA_BUF_SIZE(b)   (((b) + TXDMA_BUF_MASK) & ~TXDMA_BUF_MASK)
#    define TXDMA_BUF_ALIGN     aligned_data(ARMV7M_DCACHE_LINESIZE)
#  else
#    define TXDMA_BUF_SIZE(b)   (b)
#    define TXDMA_BUF_ALIGN
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
  bool            initialized;   /* Indicate that if has been initialized and HW is setup. */

#ifdef CONFIG_SERIAL_TERMIOS

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  bool            iflow;         /* input flow control (RTS) enabled */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  bool            oflow;         /* output flow control (CTS) enabled */
#  endif

  uintptr_t       usartbase;     /* Base address of UART registers */
  uint32_t        baud;          /* Configured baud */
  uint32_t        clock;         /* Frequency of the UART */
  uint16_t        oversamp;      /* USART oversample mode */
  uint8_t         irq;           /* IRQ associated with this USART */
  uint8_t         parity;        /* 0=none, 1=odd, 2=even */
  uint8_t         bits;          /* Number of bits (8 or 9) */
  uint8_t         stop_2bits;    /* True: Configure with 2 stop bits instead of 1 */
  uint32_t        tx_gpio;       /* USART TX GPIO pin configuration */
  uint32_t        rx_gpio;       /* USART RX GPIO pin configuration */

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  uint32_t        rts_gpio;      /* UART RTS GPIO pin configuration */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  uint32_t        cts_gpio;      /* UART CTS GPIO pin configuration */
#  endif

#else /* CONFIG_SERIAL_TERMIOS */

#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  const bool      iflow;         /* input flow control (RTS) enabled */
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  const bool      oflow;         /* output flow control (CTS) enabled */
#  endif

  const uintptr_t usartbase;     /* Base address of UART registers */
  const uint32_t  baud;          /* Configured baud */
  const uint32_t  clock;         /* Frequency of the UART */
  const uint16_t  oversamp;      /* USART oversample mode */
  const uint8_t   irq;           /* IRQ associated with this USART */
  const uint8_t   parity;        /* 0=none, 1=odd, 2=even */
  const uint8_t   bits;          /* Number of bits (7, 8, 9 or 10) */
  const uint8_t   stop_2bits;    /* True: Configure with 2 stop bits instead of 1 */
  const uint32_t  tx_gpio;       /* USART TX GPIO pin configuration */
  const uint32_t  rx_gpio;       /* USART RX GPIO pin configuration */

