GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
#if defined(SERIAL_NOT_HAVE_DMA)
static const struct uart_ops_s g_uart_ops_no_dma =
{
  .setup          = up_setup,
  .shutdown       = up_shutdown,
  .attach         = up_attach,
  .detach         = up_detach,
  .ioctl          = up_ioctl,
  .receive        = up_receive,
  .rxint          = up_rxint,
  .rxavailable    = up_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = up_rxflowcontrol,
#endif
  .send           = up_send,
  .txint          = up_txint,
  .txready        = up_txready,
  .txempty        = up_txempty,
};
#endif

/* Receive / Transmit buffers */

#ifdef CONFIG_GD32H73X_75X_USART0_SERIALDRIVER
static char g_usart0rxbuffer[CONFIG_USART0_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_USART0_TXDMA
static char g_usart0txbuffer[TXDMA_BUF_SIZE(CONFIG_USART0_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_usart0txbuffer[CONFIG_USART0_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_USART0_RXDMA
static char g_usart0rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_USART1_SERIALDRIVER
static char g_usart1rxbuffer[CONFIG_USART1_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_USART1_TXDMA
static char g_usart1txbuffer[TXDMA_BUF_SIZE(CONFIG_USART1_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_usart1txbuffer[CONFIG_USART1_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_USART1_RXDMA
static char g_usart1rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_USART2_SERIALDRIVER
static char g_usart2rxbuffer[CONFIG_USART2_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_USART2_TXDMA
static char g_usart2txbuffer[TXDMA_BUF_SIZE(CONFIG_USART2_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_usart2txbuffer[CONFIG_USART2_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_USART2_RXDMA
static char g_usart2rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_UART3_SERIALDRIVER
static char g_uart3rxbuffer[CONFIG_UART3_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_UART3_TXDMA
static char g_uart3txbuffer[TXDMA_BUF_SIZE(CONFIG_UART3_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_uart3txbuffer[CONFIG_UART3_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_UART3_RXDMA
static char g_uart3rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_UART4_SERIALDRIVER
static char g_uart4rxbuffer[CONFIG_UART4_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_UART4_TXDMA
static char g_uart4txbuffer[TXDMA_BUF_SIZE(CONFIG_UART4_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_uart4txbuffer[CONFIG_UART4_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_UART4_RXDMA
static char g_uart4rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_USART5_SERIALDRIVER
static char g_usart5rxbuffer[CONFIG_USART5_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_USART5_TXDMA
static char g_usart5txbuffer[TXDMA_BUF_SIZE(CONFIG_USART5_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_usart5txbuffer[CONFIG_USART5_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_USART5_RXDMA
static char g_usart5rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_UART6_SERIALDRIVER
static char g_uart6rxbuffer[CONFIG_UART6_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_UART6_TXDMA
static char g_uart6txbuffer[TXDMA_BUF_SIZE(CONFIG_UART6_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_uart6txbuffer[CONFIG_UART6_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_UART6_RXDMA
static char g_uart6rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

#ifdef CONFIG_GD32H73X_75X_UART7_SERIALDRIVER
static char g_uart7rxbuffer[CONFIG_UART7_RXBUFSIZE];
#  ifdef CONFIG_GD32H73X_75X_UART7_TXDMA
static char g_uart7txbuffer[TXDMA_BUF_SIZE(CONFIG_UART7_TXBUFSIZE)]
  TXDMA_BUF_ALIGN;
#  else
static char g_uart7txbuffer[CONFIG_UART7_TXBUFSIZE];
#  endif
#  ifdef CONFIG_GD32H73X_75X_UART7_RXDMA
static char g_uart7rxfifo[RXDMA_BUFFER_SIZE]
  RXDMA_BUFFER_ALIGN;
#  endif
#endif

/* This describes the state of the GD32 USART0 ports. */

#ifdef CONFIG_GD32H73X_75X_USART0_SERIALDRIVER

static struct up_dev_s g_usart0priv =
{
  .usartbase      = GD32_USART0,
  .baud           = CONFIG_USART0_BAUD,
  .clock          = GD32_PCLK2_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_USART0,
  .parity         = CONFIG_USART0_PARITY,
  .bits           = CONFIG_USART0_BITS,
  .stop_2bits      = CONFIG_USART0_2STOP,

  .tx_gpio       = GPIO_USART0_TX,
  .rx_gpio       = GPIO_USART0_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART0_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_USART0_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART0_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_USART0_CTS,
#endif
#ifdef CONFIG_GD32H73X_75X_USART0_TXDMA
  .txdma_reqid    = DMA_REQUEST_USART0_TX,
#endif
#ifdef CONFIG_GD32H73X_75X_USART0_RXDMA
  .rxdma_reqid    = DMA_REQUEST_USART0_RX,
  .rxfifo         = g_usart0rxfifo,
#endif

#ifdef CONFIG_USART0_RS485
  .rs485_dir_gpio = GPIO_USART0_RS485_DIR,
#  if (CONFIG_USART0_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_usart0port =
{
#if CONSOLE_UART == 0
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_USART0_RXBUFSIZE,
    .buffer = g_usart0rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_usart0txbuffer),
    .buffer = g_usart0txbuffer,
  },
#if defined(CONFIG_GD32H73X_75X_USART0_RXDMA) && defined(CONFIG_GD32H73X_75X_USART0_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H73X_75X_USART0_RXDMA) && !defined(CONFIG_GD32H73X_75X_USART0_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H73X_75X_USART0_RXDMA) && defined(CONFIG_GD32H73X_75X_USART0_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_usart0priv,
};
#endif

#ifdef CONFIG_GD32H73X_75X_USART1_SERIALDRIVER
static struct up_dev_s g_usart1priv =
{
  .usartbase      = GD32_USART1,
  .baud           = CONFIG_USART1_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_USART1,
  .parity         = CONFIG_USART1_PARITY,
  .bits           = CONFIG_USART1_BITS,
  .stop_2bits     = CONFIG_USART1_2STOP,

