GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
  .tx_gpio        = GPIO_USART1_TX,
  .rx_gpio        = GPIO_USART1_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART1_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_USART1_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART1_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_USART1_CTS,
#endif
#ifdef CONFIG_GD32H73X_75X_USART1_TXDMA
  .txdma_reqid    = DMA_REQUEST_USART1_TX,
#endif
#ifdef CONFIG_GD32H73X_75X_USART1_RXDMA
  .rxdma_reqid    = DMA_REQUEST_USART1_RX,
  .rxfifo         = g_usart1rxfifo,
#endif

#ifdef CONFIG_USART1_RS485
  .rs485_dir_gpio = GPIO_USART1_RS485_DIR,
#  if (CONFIG_USART1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_usart1port =
{
#if CONSOLE_UART == 1
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_USART1_RXBUFSIZE,
    .buffer = g_usart1rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_usart1txbuffer),
    .buffer = g_usart1txbuffer,
  },
#if defined(CONFIG_GD32H73X_75X_USART1_RXDMA) && defined(CONFIG_GD32H73X_75X_USART1_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H73X_75X_USART1_RXDMA) && !defined(CONFIG_GD32H73X_75X_USART1_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H73X_75X_USART1_RXDMA) && defined(CONFIG_GD32H73X_75X_USART1_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_usart1priv,
};
#endif

#ifdef CONFIG_GD32H73X_75X_USART2_SERIALDRIVER
static struct up_dev_s g_usart2priv =
{
  .usartbase      = GD32_USART2,
  .baud           = CONFIG_USART2_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_USART2,
  .parity         = CONFIG_USART2_PARITY,
  .bits           = CONFIG_USART2_BITS,
  .stop_2bits     = CONFIG_USART2_2STOP,

  .tx_gpio        = GPIO_USART2_TX,
  .rx_gpio        = GPIO_USART2_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART2_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_USART2_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART2_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_USART2_CTS,
#endif
#ifdef CONFIG_GD32H73X_75X_USART2_TXDMA
  .txdma_reqid    = DMA_REQUEST_USART2_TX,
#endif
#ifdef CONFIG_GD32H73X_75X_USART2_RXDMA
  .rxdma_reqid    = DMA_REQUEST_USART2_RX,
  .rxfifo         = g_usart2rxfifo,
#endif

#ifdef CONFIG_USART2_RS485
  .rs485_dir_gpio = GPIO_USART2_RS485_DIR,
#  if (CONFIG_USART2_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_usart2port =
{
#if CONSOLE_UART == 2
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_USART2_RXBUFSIZE,
    .buffer = g_usart2rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_usart2txbuffer),
    .buffer = g_usart2txbuffer,
  },
#if defined(CONFIG_GD32H73X_75X_USART2_RXDMA) && defined(CONFIG_GD32H73X_75X_USART2_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H73X_75X_USART2_RXDMA) && !defined(CONFIG_GD32H73X_75X_USART2_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H73X_75X_USART2_RXDMA) && defined(CONFIG_GD32H73X_75X_USART2_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_usart2priv,
};
#endif

#ifdef CONFIG_GD32H73X_75X_USART5_SERIALDRIVER

static struct up_dev_s g_usart5priv =
{
  .usartbase      = GD32_USART5,
  .baud           = CONFIG_USART5_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_USART5,
  .parity         = CONFIG_USART5_PARITY,
  .bits           = CONFIG_USART5_BITS,
  .stop_2bits     = CONFIG_USART5_2STOP,

  .tx_gpio        = GPIO_USART5_TX,
  .rx_gpio        = GPIO_USART5_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART5_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_USART5_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART5_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_USART5_CTS,
#endif
#ifdef CONFIG_GD32H73X_75X_USART5_TXDMA
  .txdma_reqid    = DMA_REQUEST_USART5_TX,
#endif
#ifdef CONFIG_GD32H73X_75X_USART5_RXDMA
  .rxdma_reqid    = DMA_REQUEST_USART5_RX,
  .rxfifo         = g_usart5rxfifo,
#endif

#ifdef CONFIG_USART5_RS485
  .rs485_dir_gpio = GPIO_USART5_RS485_DIR,
#  if (CONFIG_USART5_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_usart5port =
{
#if CONSOLE_UART == 5
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_USART5_RXBUFSIZE,
    .buffer = g_usart5rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_usart5txbuffer),
    .buffer = g_usart5txbuffer,
  },
#if defined(CONFIG_GD32H73X_75X_USART5_RXDMA) && defined(CONFIG_GD32H73X_75X_USART5_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H73X_75X_USART5_RXDMA) && !defined(CONFIG_GD32H73X_75X_USART5_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H73X_75X_USART5_RXDMA) && defined(CONFIG_GD32H73X_75X_USART5_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_usart5priv,
};
#endif

#ifdef CONFIG_GD32H73X_75X_UART3_SERIALDRIVER

static struct up_dev_s g_uart3priv =
{
  .usartbase      = GD32_UART3,
  .baud           = CONFIG_UART3_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_UART3,
  .parity         = CONFIG_UART3_PARITY,
  .bits           = CONFIG_UART3_BITS,
  .stop_2bits     = CONFIG_UART3_2STOP,

  .tx_gpio        = GPIO_UART3_TX,
  .rx_gpio        = GPIO_UART3_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART3_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_UART3_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART3_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_UART3_CTS,
#endif
#ifdef CONFIG_GD32H73X_75X_UART3_TXDMA
  .txdma_reqid    = DMA_REQUEST_UART3_TX,
#endif
#ifdef CONFIG_GD32H73X_75X_UART3_RXDMA
  .rxdma_reqid    = DMA_REQUEST_UART3_RX,
  .rxfifo         = g_uart3rxfifo,
#endif

