GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
static struct uart_dev_s g_uart7port =
{
#if CONSOLE_UART == 7
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_UART7_RXBUFSIZE,
    .buffer = g_uart7rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_uart7txbuffer),
    .buffer = g_uart7txbuffer,
  },
#if defined(CONFIG_GD32H73X_75X_UART7_RXDMA) && defined(CONFIG_GD32H73X_75X_UART7_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H73X_75X_UART7_RXDMA) && !defined(CONFIG_GD32H73X_75X_UART7_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H73X_75X_UART7_RXDMA) && defined(CONFIG_GD32H73X_75X_UART7_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_uart7priv,
};
#endif

/* This table lets us iterate over the configured USARTs */

static struct uart_dev_s * const g_uart_devs[GD32_NUSART] =
{
#ifdef CONFIG_GD32H73X_75X_USART0_SERIALDRIVER
  [0] = &g_usart0port,
#endif
#ifdef CONFIG_GD32H73X_75X_USART1_SERIALDRIVER
  [1] = &g_usart1port,
#endif
#ifdef CONFIG_GD32H73X_75X_USART2_SERIALDRIVER
  [2] = &g_usart2port,
#endif
#ifdef CONFIG_GD32H73X_75X_UART3_SERIALDRIVER
  [3] = &g_uart3port,
#endif
#ifdef CONFIG_GD32H73X_75X_UART4_SERIALDRIVER
  [4] = &g_uart4port,
#endif
#ifdef CONFIG_GD32H73X_75X_USART5_SERIALDRIVER
  [5] = &g_usart5port,
#endif
#ifdef CONFIG_GD32H73X_75X_UART6_SERIALDRIVER
  [6] = &g_uart6port,
#endif
#ifdef CONFIG_GD32H73X_75X_UART7_SERIALDRIVER
  [7] = &g_uart7port,
#endif
};

#ifdef CONFIG_PM
static  struct pm_callback_s g_serial_pmcb =
{
  .notify  = up_pm_notify,
  .prepare = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_setusartint
 ****************************************************************************/

static void up_setusartint(struct up_dev_s *priv, uint32_t ie)
{
  uint32_t regval;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* Set the interrupt bits in the USART control registers */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_USED_INTS);
  regval |= (ie & USART_CTL0_USED_INTS);
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
   * regval |= (ie & USART_CTL1_USED_INTS);
   * up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);
   */

  regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~(USART_CTL2_USED_INTS);
  regval |= (ie & USART_CTL2_USED_INTS);
  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint32_t *ie)
{
  irqstate_t flags;
  uint32_t regval;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      /* Return the current interrupt mask value for the USART */

      regval  = up_serialin(priv, GD32_USART_CTL0_OFFSET);
      regval &= USART_CTL0_INT_MASK;
      *ie     = regval;

      /* regval  = up_serialin(priv, GD32_USART_CTL1_OFFSET);
       * regval &= USART_CTL1_INT_MASK;
       *  *ie    |= regval;
       */

      regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      regval &= USART_CTL2_INT_MASK;
      *ie    |= regval;
    }

  /* Disable all interrupts */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~USART_CTL0_INT_MASK;
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
  regval &= ~USART_CTL1_INT_MASK;
  up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);

  regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~USART_CTL2_INT_MASK;
  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint32_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  up_setusartint(priv, ie);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_nextrx(struct up_dev_s *priv)
{
  size_t dmaresidual;

  dmaresidual = gd32_dma_residual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual) % RXDMA_BUFFER_SIZE;
}
#endif

/****************************************************************************
 * Name: gd32_usart_configure
 *
 * Description:
 *   Configure a UART for non-DMA operation.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void gd32_usart_configure(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t udiv;
  uint32_t intdiv;
  uint32_t fradiv;
  uint32_t regval;

