GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
      if (((priv->sr & USART_STAT_TC) != 0) &&
          ((priv->ie & USART_CTL0_TCIE) ==
            USART_CTL0_TCIE) &&
          ((priv->ie & USART_CTL0_TBEIE) !=
            USART_CTL0_TBEIE))
        {
          gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          priv->ie &= ~USART_CTL0_TCIE;
          up_restoreusartint(priv, priv->ie);
        }
#endif

      /* Handle incoming, receive bytes. */

      if (((priv->sr & USART_STAT_RBNE) != 0) &&
          ((priv->ie & USART_CTL0_RBNEIE) ==
            USART_CTL0_RBNEIE))
        {
          uart_recvchars(dev);
          handled = true;
        }

#ifdef SERIAL_HAVE_RXDMA
      /* Handle IDLE interrupt for DMA reception */

      if (((priv->sr & USART_STAT_IDLEF) != 0) &&
          ((priv->ie & USART_CTL0_IDLEIE) != 0))
        {
          /* Process received data from DMA buffer first */

          uart_recvchars(dev);

          /* Clear IDLE flag by writing to INTC register */

          up_serialout(priv, GD32_USART_INTC_OFFSET, USART_INTC_IDLEC);
          handled = true;
        }
#endif

      /* Clear USART err flags. */

      if ((priv->sr & (USART_STAT_ORERR | USART_STAT_NERR | \
                       USART_STAT_FERR | USART_STAT_PERR)) != 0)
        {
          up_serialin(priv, GD32_USART_RDATA_OFFSET);
          uint32_t regval = (USART_INTC_OREC | USART_INTC_NEC | \
                            USART_INTC_FEC | USART_INTC_PEC);
          up_serialout(priv, GD32_USART_INTC_OFFSET, regval);
        }

      /* Handle outgoing, transmit bytes */

      if (((priv->sr & USART_STAT_TBE) != 0) &&
          ((priv->ie & USART_CTL0_TBEIE) ==
           USART_CTL0_TBEIE))
        {
          /* Transmit data register empty ... process outgoing bytes */

          uart_xmitchars(dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: up_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int up_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT) \
    || defined(CONFIG_GD32H73X_75X_SERIALBRK_BSDCOMPAT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_GD32H73X_75X_SERIALBRK_BSDCOMPAT)
  struct up_dev_s   *priv  = (struct up_dev_s *)dev->priv;
#endif
  uint32_t regval;
  int      ret    = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
         struct up_dev_s *user = (struct up_dev_s *)arg;
         if (!user)
           {
             ret = -EINVAL;
           }
         else
           {
             memcpy(user, dev, sizeof(struct up_dev_s));
           }
       }
       break;
#endif

#ifdef CONFIG_GD32H73X_75X_USART_SINGLEWIRE
    case TIOCSSINGLEWIRE:
      {
        /* Change to single-wire operation. the RX pin is disconnected from
         * the USART and the UUSARTART implements a half-duplex serial
         * connection. The USART uses the TX pin for both receiving and
         * transmitting.
         */

        regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);

        if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
          {
            uint32_t gpio_val = (arg & SER_SINGLEWIRE_PUSHPULL) ==
                                 SER_SINGLEWIRE_PUSHPULL ?
                                 GPIO_CFG_PP : GPIO_CFG_OD;
            gpio_val |= ((arg & SER_SINGLEWIRE_PULL_MASK) ==
                         SER_SINGLEWIRE_PULLUP) ? GPIO_CFG_PUPD_PULLUP
                                                : GPIO_CFG_PUPD_NONE;
            gpio_val |= ((arg & SER_SINGLEWIRE_PULL_MASK) ==
                         SER_SINGLEWIRE_PULLDOWN) ? GPIO_CFG_PUPD_PULLDOWN
                                                  : GPIO_CFG_PUPD_NONE;
            gd32_gpio_config((priv->tx_gpio & ~(GPIO_CFG_ODPP_MASK |
                                                GPIO_CFG_PUPD_MASK)) |
                              gpio_val);
            regval |= USART_CTL2_HDEN;
          }
        else
          {
            gd32_gpio_config((priv->tx_gpio & ~(GPIO_CFG_ODPP_MASK |
                                                GPIO_CFG_PUPD_MASK)) |
                              GPIO_CFG_PP);
            regval &= ~USART_CTL2_HDEN;
          }

        up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
      }
     break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* The driver only support 8/9 bit modes and therefore is
         * no way to report 9-bit mode, we always claim 8.
         */

        termiosp->c_cflag =
          ((priv->parity != 0) ? PARENB : 0) |
          ((priv->parity == 1) ? PARODD : 0) |
          ((priv->stop_2bits) ? CSTOPB : 0) |
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          ((priv->iflow) ? CRTS_IFLOW : 0) |
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
          ((priv->oflow) ? CCTS_OFLOW : 0) |
#endif
          CS8;

        cfsetispeed(termiosp, priv->baud);

        /* TODO: CRTS_IFLOW, CCTS_OFLOW */
      }
      break;

    case TCSETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Perform some sanity checks before accepting any changes */

        if (((termiosp->c_cflag & CSIZE) != CS8)
#ifdef CONFIG_SERIAL_IFLOWCONTROL
            || ((termiosp->c_cflag & CRTS_IFLOW) && (priv->rts_gpio == 0))
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
            || ((termiosp->c_cflag & CCTS_OFLOW) && (priv->cts_gpio == 0))
#endif
           )
          {
            ret = -EINVAL;
            break;
          }

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        priv->stop_2bits = (termiosp->c_cflag & CSTOPB) != 0;
#ifdef CONFIG_SERIAL_IFLOWCONTROL
        priv->iflow = (termiosp->c_cflag & CRTS_IFLOW) != 0;
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
        priv->oflow = (termiosp->c_cflag & CCTS_OFLOW) != 0;
#endif

        /* Note that since there is no way to request 9-bit mode
         * and no way to support 5/6/7-bit modes, we ignore them
         * all here.
         */

        /* Note that only cfgetispeed is used because we have knowledge
         * that only one speed is supported.
         */

        priv->baud = cfgetispeed(termiosp);

