GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
#if defined(CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS) && \
    defined(CONFIG_GD32H73X_75X_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      /* Set it high resume/stop sending */

      gd32_gpio_write(priv->rts_gpio, upper);

      if (upper)
        {
          /* Return 'false' so input data is still being processed
           * until sending end reacts on nRTS signal and stops sending more.
           */

          return false;
        }

      return upper;
    }

#else
  if (priv->iflow)
    {
      /* Is the RX buffer full? */

      if (upper)
        {
          /* Disable Rx interrupt to prevent more data being from
           * peripheral.  When hardware RTS is enabled, this will
           * prevent more data from coming in.
           *
           * This function is only called when UART recv buffer is full,
           * that is: "dev->recv.head + 1 == dev->recv.tail".
           *
           * Logic in "uart_read" will automatically toggle Rx interrupts
           * when buffer is read empty and thus we do not have to re-
           * enable Rx interrupts.
           */

          uart_disablerxint(dev);
          return true;
        }

      /* No.. The RX buffer is empty */

      else
        {
          /* We might leave Rx interrupt disabled if full recv buffer was
           * read empty.  Enable Rx interrupt to make sure that more input is
           * received.
           */

          uart_enablerxint(dev);
        }
    }
#endif

  return false;
}
#endif

/****************************************************************************
 * Name: up_dma_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the USART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t nextrx = up_dma_nextrx(priv);
  int c = 0;

  /* Check if more data is available */

  if (nextrx != priv->rxdmanext)
    {
#ifdef CONFIG_ARMV7M_DCACHE
      /* If the data cache is enabled, then we will also need to manage
       * cache coherency.  Are any bytes available in the currently coherent
       * region of the data cache?
       */

      if (priv->rxdmaavail == 0)
        {
          uint32_t rxdmaavail;
          uintptr_t addr;

          /* No.. then we will have to invalidate additional space in the
           * Rx DMA buffer.
           */

          if (nextrx > priv->rxdmanext)
            {
              /* Number of available bytes */

              rxdmaavail = nextrx - priv->rxdmanext;
            }
          else
            {
              /* Number of available bytes up to the end of RXDMA buffer */

              rxdmaavail = RXDMA_BUFFER_SIZE - priv->rxdmanext;
            }

          /* Invalidate the DMA buffer range */

          addr = (uintptr_t)&priv->rxfifo[priv->rxdmanext];
          up_invalidate_dcache(addr, addr + rxdmaavail);

          /* We don't need to invalidate the data cache for the next
           * rxdmaavail number of next bytes.
           */

          priv->rxdmaavail = rxdmaavail;
        }

      priv->rxdmaavail--;
#endif

      /* Now read from the DMA buffer */

      c = priv->rxfifo[priv->rxdmanext];

      priv->rxdmanext++;
      if (priv->rxdmanext == RXDMA_BUFFER_SIZE)
        {
          priv->rxdmanext = 0;
        }
    }

  return c;
}
#endif

/****************************************************************************
 * Name: up_dma_rxint
 *
 * Description:
 *   Call to enable or disable RXDMA interrupts
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void up_dma_rxint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  irqstate_t flags;
  uint32_t ie;

  /* Enable or disable DMA reception.
   *
   * Note that it is not safe to check for available bytes and immediately
   * pass them to uart_recvchars as that could potentially recurse back
   * to us again. Instead, bytes must wait until the next up_dma_poll or
   * DMA event.
   */

  priv->rxenable = enable;

  flags = enter_critical_section();

  ie = priv->ie;
  if (enable)
    {
      /* Clear any stale IDLE condition before enabling the interrupt.
       * Otherwise we may take an immediate interrupt unrelated to new RX
       * traffic and misread the DMA state.
       */

      up_serialout(priv, GD32_USART_INTC_OFFSET, USART_INTC_IDLEC);

      /* Receive an interrupt when the DMA receive data. */

      ie |= USART_CTL0_IDLEIE;
    }
  else
    {
      ie &= ~(USART_CTL0_RBNEIE | USART_CTL0_PERRIE |
              USART_CTL0_IDLEIE | USART_CTL2_ERRIE);
    }

  /* Then set the new interrupt state */

  up_restoreusartint(priv, ie);

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_dma_rxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static bool up_dma_rxavailable(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Compare our receive pointer to the current DMA pointer, if they
   * do not match, then there are bytes to be received.
   */

  return (up_dma_nextrx(priv) != priv->rxdmanext);
}
#endif

/****************************************************************************
 * Name: up_dma_tx_callback
 *
 * Description:
 *   This function clears DMA buffer at complete of DMA transfer and wakes up
 *   threads waiting for space in buffer.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_tx_callback(DMA_HANDLE handle, uint16_t status, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Update 'nbytes' indicating number of bytes actually transferred by DMA.
   * This is important to free TX buffer space by 'uart_xmitchars_done'.
   */

  if (status & DMA_INTF_FTFIF)
    {
      dev->dmatx.nbytes += dev->dmatx.length;
      if (dev->dmatx.nlength)
        {
          /* Disable DENT before DMA reconfiguration */

          modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET,
                      USART_CTL2_DENT, 0);

          struct gd32_dma_config_s dma_config;

          dma_config.direction    = DMA_MEMORY_TO_PERIPH;
          dma_config.memory_addr  = (uint32_t)dev->dmatx.nbuffer;
          dma_config.number       = dev->dmatx.nlength;
          dma_config.periph_addr  = priv->usartbase +
                                    GD32_USART_TDATA_OFFSET;
          dma_config.periph_width = DMA_PERIPH_WIDTH_8BIT;
          dma_config.memory_width = DMA_MEMORY_WIDTH_8BIT;
          dma_config.periph_inc   = false;
          dma_config.memory_inc   = true;
          dma_config.priority     = USART_DMA_PRIO;
          dma_config.circular     = false;

#ifdef CONFIG_ARMV7M_DCACHE
          up_clean_dcache(
            (uintptr_t)dev->dmatx.nbuffer,
            (uintptr_t)dev->dmatx.nbuffer +
            dev->dmatx.nlength);
#endif

          gd32_dma_setup(priv->txdma, &dma_config);
          up_serialout(priv, GD32_USART_INTC_OFFSET, USART_INTC_TCC);

          dev->dmatx.length  = dev->dmatx.nlength;
          dev->dmatx.nlength = 0;

          gd32_dma_start(priv->txdma, up_dma_tx_callback,
                         (void *)dev, USART_TXDMA_INTEN);
          modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET,
                      0, USART_CTL2_DENT);
          return;
        }
    }
  else if (status & DMA_INTF_HTFIF)
    {
      dev->dmatx.nbytes += dev->dmatx.length / 2;
    }

  uart_xmitchars_done(dev);
}
#endif

/****************************************************************************
 * Name: up_dma_txavailable
 *
 * Description:
 *        Informs DMA that Tx data is available and is ready for transfer.
 *
 ****************************************************************************/

