GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32h73x_75x/gd32h73x_75x_serial.c
#ifdef CONFIG_GD32H73X_75X_UART4_RXDMA
  if (g_uart4priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_uart4priv.rxdma, 0, &g_uart4port);
    }
#endif

#ifdef CONFIG_GD32H73X_75X_USART5_RXDMA
  if (g_usart5priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_usart5priv.rxdma, 0, &g_usart5port);
    }
#endif

#ifdef CONFIG_GD32H73X_75X_UART6_RXDMA
  if (g_uart6priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_uart6priv.rxdma, 0, &g_uart6port);
    }
#endif

#ifdef CONFIG_GD32H73X_75X_UART7_RXDMA
  if (g_uart7priv.rxdma != NULL)
    {
      up_dma_rx_callback(g_uart7priv.rxdma, 0, &g_uart7port);
    }
#endif

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef CONSOLE_UART

  struct up_dev_s *priv = (struct up_dev_s *)g_uart_devs[CONSOLE_UART]->priv;
  uint32_t ie;

  up_disableusartint(priv, &ie);
  arm_lowputc(ch);
  up_restoreusartint(priv, ie);
#endif
}

#else /* USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef CONSOLE_UART
  arm_lowputc(ch);
#endif
}

#endif /* USE_SERIALDRIVER */
